#Задача 1: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
a = int(input())
b = int(input())
c = int(input())


max = a

if b > max:
    max = b
if c > max:
    max = c
    



print (max)

