# Задача 2: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
a = int(input())
if int%2==0:
    print("число четное")
else:
    print("число не четное")
    